def number_to_russian(x):
    num = str(x)
    hund = num[0]
    ten = num[1]
    unit = num[2]


    units_info ={
        '1': 'один',
        '2': 'два',
        '3': 'три',
        '4': 'четыре',
        '5': 'пять',
        '6': 'шесть',
        '7': 'семь',
        '8': 'восемь ',
        '9': 'девять'
    }
    teens_info ={   
        '1': 'одиннадцать',
        '2': 'двенадцать',
        '3': 'тринадцать',
        '4': 'четырнадцать',
        '5': 'пятнадцать',
        '6': 'шестнадцать',
        '7': 'семнадцать',
        '8': 'восемнадцать ',
        '9': 'девятнадцать'
    }
    tens_info  ={
        '2': 'двадцать',
        '3': 'тридцать',
        '4': 'сорок',
        '5': 'пятьдесят',
        '6': 'шестьдесят',
        '7': 'семьдесят',
        '8': 'восемьдесят ',
        '9': 'девяносто'
    }
    hundreds_info  ={
        '1':'сто',
        '2': 'двести',
        '3': 'триста',
        '4': 'четыреста',
        '5': 'пятьсот',
        '6': 'шестьсот',
        '7': 'семьсот',
        '8': 'восемьсот',
        '9': 'девятьсот'
    }


    if x == 0:
        return('Ноль')
    hund = hundreds_info.get(hund)
    if ten == 1:
        ten = tens_info.get(ten)
        unit = ''
    else:
        ten = tens_info.get(ten)
        unit = units_info.get(unit)
    return(str(hund) +' '+ str(ten) +' '+ str(unit))

print(number_to_russian(123))